src/cf/src/Documents/КоммерческоеПредложение/КоммерческоеПредложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоммерческоеПредложение</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКоммерческихПредложений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Enums/СтатусыКоммерческихПредложений/СтатусыКоммерческихПредложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКоммерческихПредложений</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Проигран</name>
  </enumValues>
  <enumValues>
    <name>Выигран</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/КоммерческоеПредложение/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрименитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПрименитьСостояниеПанели();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	ПрименитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// BSLLS:MagicNumber-off - треть секунды исключает лишние серверные вызовы при листании.
	ПодключитьОбработчикОжидания("ОбновитьСведенияОКлиенте", 0.3, Истина);
	// BSLLS:MagicNumber-on
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСведенияОКлиенте()
	Ссылка = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.КоммерческоеПредложение") Тогда
		ЗаполнитьСведения(Ссылка);
	Иначе
		КлиентТекст = "";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьПанель(Команда)
	ПанельСвернута = Истина;
	ПрименитьСостояниеПанели();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПанель(Команда)
	ПанельСвернута = Ложь;
	ПрименитьСостояниеПанели();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФильтры(Команда)
	ОткрытьСтраницуПанели("СтраницаФильтры");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКлиента(Команда)
	ОткрытьСтраницуПанели("СтраницаКлиент");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	Предложение = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(Предложение) <> Тип("ДокументСсылка.КоммерческоеПредложение") Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Основание", Предложение);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияЗаказа", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект, , , , Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияЗаказа(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
	ОбновитьСведенияОКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПрименитьСостояниеПанели()
	Элементы.ГруппаПанельЗначки.Видимость = ПанельСвернута;
	Элементы.ГруппаПодвалПанели.Видимость = Не ПанельСвернута;
	Элементы.ГруппаСтраницыСведений.Видимость = Не ПанельСвернута;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуПанели(ИмяСтраницы)
	ПанельСвернута = Ложь;
	ПрименитьСостояниеПанели();
	Элементы.ГруппаСтраницыСведений.ТекущаяСтраница = Элементы[ИмяСтраницы];
КонецПроцедуры

&НаСервере
Процедура ПрименитьОтборы()
	УстановитьОтборПоПолю("Контрагент", ОтборКонтрагент);
	УстановитьОтборПоПолю("Организация", ОтборОрганизация);
	УстановитьОтборПоПолю("Ответственный", ОтборОтветственный);
	УстановитьОтборПоПолю("Менеджер", ОтборМенеджер);
	УстановитьОтборПоПолю("Договор", ОтборДоговор);
	УстановитьОтборПоПолю("ДатаОтгрузки", ОтборДатаОтгрузки);
	УстановитьОтборПоПолю("Сумма", ОтборСумма, ВидСравненияУсловия(ОтборСуммаУсловие));
	УстановитьОтборПоПолю("Статус", ЗначениеФильтраСтатуса());
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПолю(ИмяПоля, Значение, ВидСравнения = Неопределено)
	ЭлементОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Найти(ИмяПоля);
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	КонецЕсли;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(Значение);
	Если ЭлементОтбора.Использование Тогда
		ЭлементОтбора.ПравоеЗначение = Значение;
		Если ВидСравнения <> Неопределено Тогда
			ЭлементОтбора.ВидСравнения = ВидСравнения;
		Иначе
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Статус, соответствующий выбранной позиции переключателя.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКоммерческихПредложений, Неопределено - значение отбора
//
&НаСервере
// BSLLS:MagicNumber-off - позиции соответствуют вариантам переключателя статуса в форме.
Функция ЗначениеФильтраСтатуса()
	Если ФильтрСтатуса = 1 Тогда
		Возврат Перечисления.СтатусыКоммерческихПредложений.Черновик;
	КонецЕсли;
	Если ФильтрСтатуса = 2 Тогда
		Возврат Перечисления.СтатусыКоммерческихПредложений.Отправлен;
	КонецЕсли;
	Если ФильтрСтатуса = 3 Тогда
		Возврат Перечисления.СтатусыКоммерческихПредложений.Доставлен;
	КонецЕсли;
	Если ФильтрСтатуса = 4 Тогда
		Возврат Перечисления.СтатусыКоммерческихПредложений.Проигран;
	КонецЕсли;
	Если ФильтрСтатуса = 5 Тогда
		Возврат Перечисления.СтатусыКоммерческихПредложений.Выигран;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
// BSLLS:MagicNumber-on

// Вид сравнения суммы по выбранной позиции переключателя.
//
// Параметры:
//  Позиция - Число - позиция переключателя сравнения
//
// Возвращаемое значение:
//  ВидСравненияКомпоновкиДанных - условие отбора суммы
//
&НаСервереБезКонтекста
// BSLLS:MagicNumber-off - позиции соответствуют вариантам переключателя сравнения в форме.
Функция ВидСравненияУсловия(Позиция)
	Если Позиция = 1 Тогда
		Возврат ВидСравненияКомпоновкиДанных.Меньше;
	КонецЕсли;
	Если Позиция = 2 Тогда
		Возврат ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	Возврат ВидСравненияКомпоновкиДанных.Больше;
КонецФункции
// BSLLS:MagicNumber-on

&НаСервере
Процедура ЗаполнитьСведения(Знач Ссылка)
	Если Не ЗначениеЗаполнено(Ссылка.Контрагент) Тогда
		КлиентТекст = "";
		Возврат;
	КонецЕсли;
	Карточка = Справочники.Контрагенты.ПолучитьКарточку(Ссылка.Контрагент, Ссылка.Дата);
	Строки = Новый Массив;
	Строки.Добавить(Карточка.Наименование);
	Если ЗначениеЗаполнено(Карточка.Реквизиты.ICE) Тогда
		Строки.Добавить("ICE: " + Карточка.Реквизиты.ICE);
	КонецЕсли;
	Если ЗначениеЗаполнено(Карточка.АдресЮридический) Тогда
		Строки.Добавить(Карточка.АдресЮридический);
	КонецЕсли;
	Если ЗначениеЗаполнено(Карточка.Телефоны) Тогда
		Строки.Добавить(Карточка.Телефоны);
	КонецЕсли;
	КлиентТекст = СтрСоединить(Строки, Символы.ПС);
КонецПроцедуры
#КонецОбласти
